tests/performance/locust/taurus.yml
---
execution:
  - executor: locust
    concurrency: 30
    ramp-up: 30s
    hold-for: 5m
    iterations: 10000
    scenario: example

scenarios:
  example:
    default-address: http://10.35.101.188:%%PORT%%
    script: Locustfile.py
reporting:
  - module: final-stats
    summary: true
    percentiles: true
    summary-labels: false
    failed-labels: false
    test-duration: true
    dump-xml: performance-report.xml
    dump-csv: performance-report.csv